In [31]:
import pandas as pd
import numpy as np

In [32]:
time_series_confermed = pd.read_csv('csse_covid_19_data/csse_covid_19_time_series/time_series_19-covid-Confirmed.csv')
time_series_deaths = pd.read_csv('csse_covid_19_data/csse_covid_19_time_series/time_series_19-covid-Deaths.csv')
time_series_recivered = pd.read_csv('csse_covid_19_data/csse_covid_19_time_series/time_series_19-covid-Recovered.csv')

In [33]:
time_series_confermed.head()

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,3/5/20,3/6/20,3/7/20,3/8/20,3/9/20,3/10/20,3/11/20,3/12/20,3/13/20,3/14/20
0,NaN,Thailand,15.0000,101.0000,2,3,5,7,8,8,...,47,48,50,50,50,53,59,70,75,82
1,NaN,Japan,36.0000,138.0000,2,1,2,2,4,4,...,360,420,461,502,511,581,639,639,701,773
2,NaN,Singapore,1.2833,103.8333,0,1,3,3,4,5,...,117,130,138,150,150,160,178,178,200,212
3,NaN,Nepal,28.1667,84.2500,0,0,0,1,1,1,...,1,1,1,1,1,1,1,1,1,1
4,NaN,Malaysia,2.5000,112.5000,0,0,0,3,4,4,...,50,83,93,99,117,129,149,149,197,238

In [34]:
time_series_confermed = time_series_confermed[time_series_confermed['Country/Region']=='Japan'].drop(['Lat','Long','Province/State'], axis=1)
time_series_confermed

,Country/Region,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,1/28/20,1/29/20,1/30/20,...,3/5/20,3/6/20,3/7/20,3/8/20,3/9/20,3/10/20,3/11/20,3/12/20,3/13/20,3/14/20
1,Japan,2,1,2,2,4,4,7,7,11,...,360,420,461,502,511,581,639,639,701,773

In [29]:
time_series_confermed.pivot

Country/Region  1    Japan
1/22/20         1        2
1/23/20         1        1
1/24/20         1        2
1/25/20         1        2
1/26/20         1        4
1/27/20         1        4
1/28/20         1        7
1/29/20         1        7
1/30/20         1       11
1/31/20         1       15
2/1/20          1       20
2/2/20          1       20
2/3/20          1       20
2/4/20          1       22
2/5/20          1       22
2/6/20          1       45
2/7/20          1       25
2/8/20          1       25
2/9/20          1       26
2/10/20         1       26
2/11/20         1       26
2/12/20         1       28
2/13/20         1       28
2/14/20         1       29
2/15/20         1       43
2/16/20         1       59
2/17/20         1       66
2/18/20         1       74
2/19/20         1       84
2/20/20         1       94
2/21/20         1      105
2/22/20         1      122
2/23/20         1      147
2/24/20         1      159
2/25/20         1      170
2/26/20         1      189
2/27/20         1      214
2/28/20         1      228
2/29/20         1      241
3/1/20          1      256
3/2/20          1      274
3/3/20          1      293
3/4/20          1      331
3/5/20          1      360
3/6/20          1      420
3/7/20          1      461
3/8/20          1      502
3/9/20          1      511
3/10/20         1      581
3/11/20         1      639
3/12/20         1      639
3/13/20         1      701
3/14/20         1      773
dtype: object